EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
typedef enum
{
	NORMAL,
	PASSWORD,
	NUMENTRY,
}KEY_MODE;

KEY_MODE key_mode;

#endif
//******************************************************************************************//
//*************************************** menu_task ****************************************//
//******************************************************************************************//
ESOS_USER_TASK(menu_task)
{
	static UCHAR data1;
	static UINT data4;
    static ESOS_TASK_HANDLE menu_handle;
    static ESOS_TASK_HANDLE rt_handle;
	static ESOS_TASK_HANDLE comm1_handle;
	static int screen_dim;
	static UCHAR screen_dim_array[9];
	static int screen_dim_ptr;
	
    ESOS_TASK_BEGIN();

	menu_handle = esos_GetTaskHandle(display_menu);
	rt_handle = esos_GetTaskHandle(display_rtlabels);

	comm1_handle = esos_GetTaskHandle(send_comm1);
	screen_dim = 0;

	screen_dim_array[0] =  PWM_OFF_PARAM;
	screen_dim_array[1] =  PWM_ON_PARAM;
	screen_dim_array[2] =  PWM_80DC_PARAM;
	screen_dim_array[3] =  PWM_75DC_PARAM;
	screen_dim_array[4] =  PWM_60DC_PARAM;
	screen_dim_array[5] =  PWM_50DC_PARAM;
	screen_dim_array[6] =  PWM_30DC_PARAM;
	screen_dim_array[7] =  PWM_25DC_PARAM;
	screen_dim_array[8] =  PWM_12DC_PARAM;
	screen_dim_ptr = 0;
	lights_on = -1;
	fan_on = 0;
	blower_on = 0;

	while (TRUE)
	{
		ESOS_TASK_WAIT_FOR_MAIL();

		while(ESOS_TASK_IVE_GOT_MAIL())
		{
			data1 = __esos_CB_ReadUINT8(__pstSelf->pst_Mailbox->pst_CBuffer);
/*
			avr_buffer[0] = SEND_BYTE_RT_VALUES;
			avr_buffer[1] = 1;
			avr_buffer[2] = 0;
			avr_buffer[3] = data1 - KP_1;
			AVR_CALL();
*/
			switch(data1)
			{
				case 	KP_1:
					switch(menu_ptr)
					{
						case 0:
							if(engine_on == 0)
							{
								__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,START_SEQ);
								engine_on = 1;
							}
						break;
						case 1:
						break;
						default:
						break;
					}
				break;

				case 	KP_2:
					switch(menu_ptr)
					{
						case 0:
							__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,SHUTDOWN);
							engine_on = 0;
						break;
						case 1:
						break;
						default:
						break;
					}
				break;

				case	KP_3:
					switch(menu_ptr)
					{
						case 0:
							__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,OFF_LIGHTS);
							lights_on = -1;
						break;
						case 1:
						break;
						default:
						break;
					}
				break;

				case	KP_4:
					switch(menu_ptr)
					{
						case 0:
							if(fan_on == 0)
							{
								__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,ON_FAN);
								fan_on = 1;
							}
							else
							{
								__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,OFF_FAN);
								fan_on = 0;
							}
						break;
						case 1:
						break;
						default:
						break;
					}
				break;

				case	KP_5:
					switch(menu_ptr)
					{
						case 0:
							if(blower_on == 1)
							{
								__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,BLOWER_OFF);
								blower_on = 0;
							}else
							{
								__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,BLOWER3);
								blower_on = 1;
							}
/*
							data4 = LCD_PWM;
							data4 <<= 8;
							data4 &= 0xFF00;
							data4 |= screen_dim_array[screen_dim_ptr];
							__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data4);
							if(++screen_dim_ptr > 9)
								screen_dim_ptr = 0;
*/
						break;
						case 1:
						break;
						default:
						break;
					}
				break;

				case	KP_6:
					switch(menu_ptr)
					{
						case 0:
							data4 = LCD_PWM;
							data4 <<= 8;
							data4 &= 0xFF00;
							data4 |= screen_dim_array[screen_dim_ptr];
							__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data4);
							if(--screen_dim_ptr < 0)
								screen_dim_ptr = 9;
						break;
						case 1:
						break;
						default:
						break;
					}
				break;

				case	KP_7:
					switch(menu_ptr)
					{
						case 0:	// toggle lights
							if(lights_on < 10)
							{
								__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,ON_LIGHTS);
								lights_on = 30;
							}
							else
							{
								__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,
									OFF_LIGHTS);
								lights_on = -1;
							}
						break;
						case 1:
						break;
						default:
						break;
					}
				break;

				case	KP_8:
/*
					switch(menu_ptr)
					{

						case 0:	// set time & date - use numentry and enter as: MMDDYYHHMM
							curr_num_entry_row = 7;
							curr_num_entry_col = 0;
							avr_buffer[0] = GOTO_CMD;
							avr_buffer[1] = (UCHAR)curr_num_entry_row;
							avr_buffer[2] = (UCHAR)curr_num_entry_col;
							AVR_CALL();
							key_mode = NUMENTRY;
							num_entry_type = TIME_DATE;
							num_entry_limit = 1;
						break;
						case 1:
						break;
						default:
						break;
					}
*/
				break;

				case	KP_9:
					switch(menu_ptr)
					{
						case 0:
						break;
						case 1:
						break;
						default:
						break;
					}
				break;

				case	KP_POUND:

					switch(menu_ptr)
					{
						case 0:
						break;
						case 1:
						break;
						default:
						break;
					}
				break;

				case	KP_AST:
					switch(menu_ptr)
					{
						case 0:
							if(ESOS_IS_TASK_SLEEPING(recv_handle))
								ESOS_WAKE_TASK(recv_handle);
						break;
						case 1:
						break;
						default:
						break;
					}
				break;

				case	KP_0:
					switch(menu_ptr)
					{
						case 0:
						break;
						case 1:
						break;
						default:
						break;
					}
				break;

				case	KP_A:		// change menu
					if(menu_ptr > NO_MENUS)
						menu_ptr = 0;
					menu_ptr++;	
					__esos_CB_WriteUINT8(menu_handle->pst_Mailbox->pst_CBuffer,menu_ptr*NUM_MENU_LABELS);
				break;

				case	KP_B:		// toggle screen brightness
					data4 = LCD_PWM;
					data4 <<= 8;
					data4 &= 0xFF00;
					if(screen_dim == 1)
						data4 |= PWM_12DC_PARAM;
					else data4 |= PWM_ON_PARAM;
					__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data4);
					screen_dim = (screen_dim == 1?0:1);

				break;

