EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
		if(gl_engine_temp < 40)		// 68F
		{
		// turn fan off
			if(fan_on == 0)
			{
				if(lengine_fan == 1)
				{
					__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,OFF_FAN);
					lengine_fan = 0;
				}
			}
		}
		
//		if(gl_indoor_temp > )

		// 54 = 80F
		// 43 = 70F
		// 32 = 60F
		if(blower_on == 0)
		{
			if(gl_indoor_temp > 54)
			{
				if(lfan_on != 0)
				{
					__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,BLOWER_OFF);
					lfan_on = 0;
	/*
					avr_buffer[0] = SEND_BYTE_RT_VALUES;
					avr_buffer[1] = 1;
					avr_buffer[2] = 37;
					avr_buffer[3] = 0;
					AVR_CALL();
	*/
				}
			}

			if(gl_indoor_temp > 43 && gl_indoor_temp < 54)
			{
				if(lfan_on != 1)
				{
					__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,BLOWER1);
					lfan_on = 1;
	/*
					avr_buffer[0] = SEND_BYTE_RT_VALUES;
					avr_buffer[1] = 1;
					avr_buffer[2] = 37;
					avr_buffer[3] = 1;
					AVR_CALL();
	*/
				}
			}
		
			if(gl_indoor_temp > 32 && gl_indoor_temp < 43)
			{
				if(lfan_on != 2)
				{
					__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,BLOWER2);
					lfan_on = 2;
	/*
					avr_buffer[0] = SEND_BYTE_RT_VALUES;
					avr_buffer[1] = 1;
					avr_buffer[2] = 37;
					avr_buffer[3] = 2;
					AVR_CALL();
	*/
				}
			}

			if(gl_indoor_temp < 32 && gl_engine_temp > 100)
			{
				if(lfan_on != 3)
				{
					__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,BLOWER3);
					lfan_on = 3;
	/*
					avr_buffer[0] = SEND_BYTE_RT_VALUES;
					avr_buffer[1] = 1;
					avr_buffer[2] = 37;
					avr_buffer[3] = 3;
					AVR_CALL();
	*/
				}
			}
		}
 	}
    ESOS_TASK_END();
}
//******************************************************************************************//
//************************************** poll_keypad ***************************************//
//******************************************************************************************//
ESOS_USER_TASK(poll_keypad)
{

    static ESOS_TASK_HANDLE menu_task_handle;
    static ESOS_TASK_HANDLE password_handle;
    static ESOS_TASK_HANDLE numentry_handle;
	static UINT data3;

    ESOS_TASK_BEGIN();

	menu_task_handle = esos_GetTaskHandle(menu_task);
	password_handle = esos_GetTaskHandle(password_task);
	numentry_handle = esos_GetTaskHandle(numentry_task);

	configKeypad();

	while (TRUE)
	{
		ESOS_TASK_WAIT_SEMAPHORE(key_sem,1);
		if(u8_newKey)
		{
			switch(key_mode)
			{
				case NORMAL:
					__esos_CB_WriteUINT8(menu_task_handle->pst_Mailbox->pst_CBuffer,u8_newKey);
					break;
				case PASSWORD:
					__esos_CB_WriteUINT8(password_handle->pst_Mailbox->pst_CBuffer,u8_newKey);
					break;
				case NUMENTRY:
					__esos_CB_WriteUINT8(numentry_handle->pst_Mailbox->pst_CBuffer,u8_newKey);
					break;
				default:
					break;
			}
			u8_newKey = 0;	// very important to reset this to 0
			// if key_enter_time has dimmed screen then
			// turn it back on
	
			if(dim_screen > 0)
			{
				data3 = LCD_PWM;
				data3 <<= 8;
				data3 &= 0xFF00;
				data3 |= PWM_ON_PARAM;
				__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
				dim_screen = 0;
			}
			key_enter_time = 0;
		}
	}
    ESOS_TASK_END();
}
//******************************************************************************************//
//**************************************** convADC  ****************************************//
//******************************************************************************************//
ESOS_USER_TASK(convADC)
{
//    static  uint8_t data1, u8_wdtState;
//	static uint16_t u16_adcVal1, u16_adcVal2;
	static uint8_t i;
	static float fres;
//	static ESOS_TASK_HANDLE comm1_handle;

    ESOS_TASK_BEGIN();
//	comm1_handle = esos_GetTaskHandle(send_comm1);

	CONFIG_RB0_AS_ANALOG();		// 2nd knob on monster box
	CONFIG_RB1_AS_ANALOG();		// 1st knob on monster box
	CONFIG_RB2_AS_ANALOG();		// engine temp
	CONFIG_RB3_AS_ANALOG();		// oil pressure

	CONFIG_RB4_AS_ANALOG();		// air temp
	CONFIG_RB5_AS_ANALOG();		// map
/*
	CONFIG_RB6_AS_ANALOG();		// can't use these
	CONFIG_RB7_AS_ANALOG();		// unless prog to chip and jumper
*/
	CONFIG_RB8_AS_ANALOG();		// oil temp
	CONFIG_RB9_AS_ANALOG();		// o2

	CONFIG_RB10_AS_ANALOG();	// extra
	CONFIG_RB11_AS_ANALOG();	// extra

	CONFIG_RB12_AS_ANALOG();	// extra
//	CONFIG_RB13_AS_ANALOG();

//	CONFIG_RB14_AS_ANALOG();
//	CONFIG_RB15_AS_ANALOG();

//	configADC1_AutoScanIrqCH0( ADC_SCAN_AN0 | ADC_SCAN_AN1 | ADC_SCAN_AN2 |
//			 ADC_SCAN_AN3 | ADC_SCAN_AN4 | ADC_SCAN_AN5, 31, 0);

//	configADC1_AutoScanIrqCH0( 0xFFFF, 31, 0);
	/// can't do 6 & 7 unless program to chip and use jumpers
	// because 6 & 7 are shared by Pickit programmer!
	configADC1_AutoScanIrqCH0( 0x1F3F, 31, 0);
//	configADC1_AutoHalfScanIrqCH0(0x00FF, 31, 0);
	while (!AD1CON1bits.DONE)
		ESOS_TASK_WAIT_TICKS(1);

//	ESOS_TASK_SLEEP();

	while (TRUE)
	{
		if(key_mode == NORMAL)
		{
			while (u8_waiting)	// wait for valid data in ISR
				ESOS_TASK_WAIT_TICKS(1);

			u8_waiting = 0;
			for (i = 0;i<NUM_ADC_CHANNELS;i++)
			{
				fres = (float)au16_buffer[i];
				fres *= 107.0;
				fres /= 1023.0;
				u8_pot[i] = (UCHAR)fres;
			}
			// this sends the ADC data to the TS-7200
//			__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,RT_DATA);
		}
		ESOS_TASK_WAIT_TICKS(500);
	}
	ESOS_TASK_END();
}
//******************************************************************************************//
//************************************ ACD1Interrupt  **************************************//
//******************************************************************************************//
void _ISR _ADC1Interrupt (void)
{
	uint8_t			u8_i;
	uint16_t*		au16_adcHWBuff = (uint16_t*) &ADC1BUF0;

	for ( u8_i=0; u8_i<NUM_ADC_CHANNELS; u8_i++)
	{
		au16_buffer[u8_i] = au16_adcHWBuff[u8_i];
	} //end for()
	u8_waiting = 0;  // signal main() that data is ready
	_AD1IF = 0;   //clear the interrupt flag
}
/*********************************************************************************/
// for temp conversion from raw data to F or C
// 0x0001 -> 0x00FA is valid +F and 0x0193 -> 0x01ff is valid for -F readings
#if 0
static float convert_to_T_F(int raw_data)
	{
	float T_F, T_celcius;
	if ((raw_data & 0x100) != 0)
	{
		raw_data = - (((~raw_data)+1) & 0xff); /* take 2's comp */   
	}
	T_celcius = raw_data * 0.5;
	if(T_celcius > 125 || T_celcius < -54)
	{
//		printf("OOR ");		// out of range error
		return 0;
	}
	T_F = (T_celcius * 1.8) + 32;
	return(T_F);	// returns 257 -> -67		(F)
//	return(T_celcius);	// returns 125 -> -55	(C)
}
#endif
